Repository: lostmsu/Rob
Catalog: UWP/Strings/*/Resources.resw
Source language: en_us
Languages: fr, ru

# TutorialToggle.Label
source: Tutorial
fr: Tutoriel
ru: Обучение

# Conditions.Content
source: Conditions
fr: Les conditions
ru: Условия

# FirstSteps.Content
source: First Steps
fr: Les premières démarches
ru: Первые шаги

# Recursion.Content
source: Recursion
fr: La récursivité
ru: Рекурсия

# TutorialTitle.Text
source: Tutorial
fr: Tutoriel
ru: Обучение

# AllCollection.Content
source: ALL
fr: TOUS
ru: ВСЕ

# App.Text
source: Rob
ru: Роб

# Settings.Text
source: Settings
fr: Paramètres
ru: Настройки

# CampaignCollection.Content
source: CAMPAIGN
fr: CAMPAGNE
ru: КАМПАНИЯ

# CommandsClear.Text
source: CLEAR
fr: EFFACER
ru: ОЧИСТИТЬ

# DarkTheme.Content
source: Dark
fr: Sombre
ru: Темная

# HideUnpopular.Text
source: hide unpopular
fr: Seulement populaires
ru: только популярные

# LightTheme.Content
source: Light
fr: Léger
ru: Светлая

# HideSolved.Text
source: hide solved
fr: Masquer résolus
ru: скрыть решённые

# Difficulty.Text
source: difficulty:
fr: difficulté:
ru: сложность:

# Edit.Label
source: Edit
fr: Correction
ru: Правка

source: loading...
fr: chargement...
ru: загрузка...

# LoadingScreen.Text
source: loading...
fr: chargement...
ru: Загрузка...

source: logging in...
fr: vous êtes connecté...
ru: выполняется вход...

# Pause.Label
source: Pause
ru: Пауза

# Popularity.Text
source: popularity:
fr: popularité:
ru: популярность:

# QueryingNewLevels
source: checking for new puzzles...
fr: téléchargant des nouveaux puzzles...
ru: загрузка новых головоломок...

# Redo.Label
source: Redo
fr: Refaire
ru: Повторить

# SavingNewLevels
source: saving updates...
fr: enregistrement des mises à jour...
ru: сохранение новых уровней...

# Search.Label
source: Search
fr: Recherche
ru: Поиск

# SearchPlaceholder
source: puzzle title
fr: titre de puzzle
ru: название головоломки

# Start.Label
source: Start
fr: Exécuter
ru: Запуск

# Step.Label
source: Step
fr: Pas
ru: Шаг

source: submitting solutions...
fr: envoyant les solutions...
ru: отправка решений...

# UISetting.Text
source: UI
fr: L'INTERFACE UTILISATEUR
ru: Интерфейс

# ThemeSetting.Text
source: Theme
fr: Thème
ru: Тема

# ThemeSettingNote.Text
source: Theme change requires app to restart
fr: On doit redémarrer l'app après la modification du thème
ru: Изменение темы требует перезапуска приложения

# Undo.Label
source: Undo
fr: Annuler
ru: Отменить

# RegisterButton.Content
source: Register
fr: Enregistrer
ru: Зарегистрироваться

# LoginButton.Content
source: Login
fr: Connexion
ru: Войти

# EmailSetting.Text
source: E-mail (only to register)
fr: E-mail (s'inscrire seulement)
ru: Электронная почта (только для регистрации)

# PasswordSetting.Text
source: Password
fr: Mot de passe
ru: Пароль

# LoginSetting.Text
source: Login
fr: Nom d'utilisateur
ru: Имя пользователя

# AccountSettingDescription.Text
source: Connect to the online service to synchronize your solved puzzle list, and share statistics with others.
fr: Se connecter à Internet. pour synchroniser votre liste des puzzles résolus et pour partager des statistiques avec d'autres.
ru: Подключитесь к сайту для синхронизации списка решений, и чтобы поделиться статистикой с другими пользователями.

# AccountSetting.Text
source: Account
fr: Informations d'identification
ru: Синхронизация

# AI_Agree
source: Accept
fr: Accepter
ru: Согласиться

# AI_Agreement
source: Share the steps you take to solve puzzles with an AI research project. The goal is to build a fully automated solver for Rob. We will analyze what does it take for you to solve puzzles, and improve our algorithm accordingly. Terms and conditions 1. You allow submission of puzzle solution telemetry to Lost Tech LLC. Submitted telemetry can include: - opening puzzle - program editing steps (editing commands, undo, redo, etc.) - running, stopping, pausing, and stepping with a robot - timestamps for all actions above - your login and hashed password for RoboZZle.com 2. You allow Lost Tech LLC to use your login and hashed password for RoboZZle.com to verify that you have a valid account on RoboZZle.com. Lost Tech LLC will not store this data or share it with 3rd parties. 3. You allow all other telemetry listed in 1. to be used for the purpose of research in artificial intelligence. 4. You allow Lost Tech LLC royalty-free use of this data, and any derived products of the research for any commercial purpose, including sharing with 3rd parties.
fr: Partagez vos démarches pour résoudre les Rob puzzles avec un projet de recherche en IA. Le but est de construire un solveur entièrement automatisé pour les Rob puzzles. Nous allons analyser ce que faut-il pour résoudrer les puzzles, et améliorer notre algorithme en conséquence. Termes et conditions 1. Vous autorisez Lost Tech LLC la soumission de télémetrie de solution de puzzle. La télémétrie peut inclure: - ouverture de puzzle - les étapes d'édition de programme (commandes d'édition, défaire, refaire, etc.) - début, arrêt, pause, pas à pas exécution de programme - horodatages des toutes les actions dessus - Votre nom d'utilisateur et mot de passe haché pour RoboZZle.com 2. Vous autorisez Lost Tech LLC à utiliser votre nom d'utilisateur et mot de passe haché pour RoboZZle.com pour vérifier que vous avez un compte valide sur RoboZZle.com. Lost Tech LLC ne sera pas stocker ces données ou les partager avec des tiers. 3. Vous autorisez Lost Tech LLC l'utilisation des tous les autres télémetries énumérés dans 1. aux fins de la recherche en intelligence artificielle. 4. Vous autorisez Lost Tech LLC l'utilisation gratuite de ces données, et tout produits de la recherche qui en dérivent à des fins commerciales, y compris le partage avec des tiers.
ru: Отправьте свои решения задачек Rob нашему исследовательскому проекту, занимающемуся разработкой искуственного интеллекта. Цель проекта - создание полностью автоматического решателя для Rob. Мы проанализируем, какие шаги были предприняты во время решения, в каких местах пришлось подумать, и постараемся улучшить наш алгоритм. Условия и положения 1. Вы разрешаете отправку шагов решения задачек Lost Tech LLC. Передаваемые данные: - открытие задачки - редактирование программы робота (редактирование комманд, отмена, повтор, и т.д.) - запуск, остановка, приостановка и пошаговое выполнение программы роботом - отметки времени для всех перечисленных действий - имя пользователя и защищённый пароль для RoboZZle.com 2. Вы разрешаете Lost Tech LLC использовать имя пользователя и пароль для RoboZZle.com, чтобы авторизовывать Вас на RoboZZle.com. Lost Tech LLC не будет хранить эти данные или делиться ими с посторонними. 3. Вы разрешаете Lost Tech LLC использовать все остальные данные, перечисленные в 1., в исследованиях в области искуственного интеллекта. 4. Вы разрешаете Lost Tech LLC использовать эти данные (за исключением имени пользователя и защищённого пароля) и любые результаты исследования без ограничений в любых коммерческих целях, включая продажу третьим лицам.

# AI_Decline
source: Decline
fr: Refuser
ru: Отказаться

# AI_MustLogin
source: To participate in AI research, you must login or register new account
fr: Pour participer à la recherche en IA, vous devez vous connecter ou vous inscrire à un nouveau compte
ru: Вы должны войти или зарегистрироваться, чтобы мы смогли отправить решения

# AI_OfferTitle
source: Participate in AI research
fr: Participer à la recherche en IA
ru: Поучаствуйте в исследовании

# AI_Research.Text
source: AI Research
fr: Recherche en IA
ru: Проект ИИ

# AI_ResearchBlog.Text
source: more info
fr: plus d’infos
ru: узнать больше

# AI_ResearchSetting.Header
source: Participate in Rob AI research
fr: Participer à la recherche Rob AI
ru: Учавствовать в разработке ИИ для Rob

# BlueConditionHint.Text
source: Only on Blue
fr: Bleue seulement
ru: Только на синем

# CallFunctionHint.Text
source: Call a function (Fx)
fr: Appeler une fonction (Fx)
ru: Вызов функции (Fx)

# GreenConditionHint.Text
source: Only on Green
fr: Verte seulement
ru: Только на зелёном

# MoveAroundHint.Text
source: Select items on the screen
fr: Sélectionner des éléments sur l'écran
ru: Выделение элементов на экране

# MovementActionsHint.Text
source: Move or rotate robot
fr: Robot tourne ou se déplace
ru: Повороты и движение робота

# PaintHint.Text
source: Paint Cell (when available)
fr: Сhange la couleur (si permis)
ru: Перекрасить клетку (где можно)

# RedConditionHint.Text
source: Only on Red
fr: Rouge seulement
ru: Только на красном

# RunPauseHint.Text
source: Run/Pause robot
fr: Exécuter/Pause le robot
ru: Запуск робота/Пауза

# StopHint.Text
source: Stop robot
fr: Arrêter le robot
ru: Остановить робота

# UnconditionalHint.Text
source: Remove condition
fr: Supprimer la condition
ru: Убрать условие

# XboxKeyMap.Content
source: Controller buttons
fr: Boutons du contrôleur
ru: Кнопки геймпада

source: No Internet
fr: pas d'Internet
ru: Нужен Интернет

# SubmitFailed_NoInternet
source: Failed to submit solution, because online service is unavailable. You will need to rerun this puzzle to resubmit.
fr: Impossible d'envoyer la solution, car le service en ligne n'est pas disponible. Vous devrez réexécuter ce puzzle pour l'envoyer à nouveau.
ru: Не удалось отправить решение из-за недоступности сервиса. Нужно будет перезапустить решение, чтобы попробовать отправить снова.
